---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ConduitSettings
source: html/c86a1700-e477-3888-7647-3eafa528fe5d.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSettings

The conduit settings.

## Syntax (C#)
```csharp
public class ConduitSettings : Element
```